[{"model": "auth.user", "pk": 1, "fields": {"password": "pbkdf2_sha256$870000$kYXGygtei3ecuLvqGf8Yb5$mJEpD4OeuhG+f5VP0qDqj4ZB8it9RhoQOkjRnECW5J4=", "last_login": null, "is_superuser": true, "username": "amandubey", "first_name": "", "last_name": "", "email": "", "is_staff": true, "is_active": true, "date_joined": "2025-01-11T16:14:56.223Z", "groups": [], "user_permissions": []}}, {"model": "auth.user", "pk": 2, "fields": {"password": "pbkdf2_sha256$870000$YosvvsAhqryy8UcTVjGFvm$R7g3AtawxVG+nGDrFnbz8Jq+Cc9posp+uiOZ2W8j40U=", "last_login": "2025-01-12T17:24:01.104Z", "is_superuser": false, "username": "aman.dubey@atmecs.com", "first_name": "Aman", "last_name": "Dubey", "email": "dubeyaman174@gmail.com", "is_staff": false, "is_active": true, "date_joined": "2025-01-11T16:21:35.648Z", "groups": [], "user_permissions": []}}, {"model": "auth.user", "pk": 3, "fields": {"password": "pbkdf2_sha256$870000$dVep574DvDK36ofWVk7hkg$BgexrxRA5Pah3dxlft7xHdXC89F1qJtL+RdFGk2Vy9A=", "last_login": "2025-01-12T03:06:05.260Z", "is_superuser": false, "username": "amandubey1681999@gmail.com", "first_name": "", "last_name": "", "email": "", "is_staff": false, "is_active": true, "date_joined": "2025-01-11T18:22:16.578Z", "groups": [], "user_permissions": []}}, {"model": "auth.user", "pk": 4, "fields": {"password": "pbkdf2_sha256$870000$XTIessxpz84ID6QQ2iQacH$DGhabbFt0SeZi+fjW8SqqbdBEK/WXdJMq4KCIfChq+U=", "last_login": "2025-01-13T06:03:55.543Z", "is_superuser": false, "username": "vikas@gmail.com", "first_name": "", "last_name": "", "email": "", "is_staff": false, "is_active": true, "date_joined": "2025-01-12T03:59:03.757Z", "groups": [], "user_permissions": []}}, {"model": "sessions.session", "pk": "igmulgjzk0t83gnome3wb6mhg8o9out4", "fields": {"session_data": ".eJxVjEEOwiAQRe_C2hBaGaa4dN8zNDMMSNVAUtqV8e7apAvd_vfef6mJtjVPW4vLNIu6KKtOvxtTeMSyA7lTuVUdalmXmfWu6IM2PVaJz-vh_h1kavlbOx-S8egdJyQAD0TAQdAwokTTE5BIL-GccBjIBw-ms5wEo3CXnFXvD_7SONg:1tXDYJ:wXLXbR2r6SMh64XuU_-ByB_76achcQb41R677QZ2-VM", "expire_date": "2025-01-27T06:03:55.545Z"}}, {"model": "sessions.session", "pk": "ku4eqdkm8cpgjbqhwr1ef8sz8cwkt3te", "fields": {"session_data": ".eJxVjEEOgjAQRe_StWmgw3TApXvPQGY6xaKmTSisjHdXEha6_e-9_zIjb2satxqXcVZzNs6cfjfh8Ih5B3rnfCs2lLwus9hdsQet9lo0Pi-H-3eQuKZvHVsn4IM2igiDAA4DePWIEzglRIHoe6KuCahdI_2EyKwUqIMWicS8P8moNyM:1tWezi:XxYzsK0aTndEo-sEoWHbS-Lyi0261PrXrFzk899b5ic", "expire_date": "2025-01-25T17:09:54.657Z"}}, {"model": "sessions.session", "pk": "t0r704rnyc9bwzcqy96wx49uk4q7khn1", "fields": {"session_data": ".eJxVjDsOwjAQRO_iGlm7xr9Q0nMGy961cQA5UpxUiLuTSCmgnHlv5i1CXJca1p7nMLK4CCVOv12K9MxtB_yI7T5Jmtoyj0nuijxol7eJ8-t6uH8HNfa6rQGSBnRIGpQv1njIVgF6PRjMqJVhQPAODRM7uwW2NDitoZwRyRbx-QKSyTYH:1tX1gv:3Q8fTBTeh23PKJwMU3JY7tC5MX1yTKpuBdvvE0Kn_d0", "expire_date": "2025-01-26T17:24:01.106Z"}}, {"model": "recipes.category", "pk": 1, "fields": {"name": "Fruit and vegetables", "description": "You should eat at least five portions of fruit and vegetables a day. They contain important vitamins and minerals that help prevent disease as well as fibre which can lower cholesterol, keep the bowel healthy and help digestion.\r\n\r\nFruit and vegetables are low in fat, so they’re great for bulking out meals and making you feel full without adding too many calories.\r\n\r\nIt’s easy to get your five a day if you spread your portions through the day."}}, {"model": "recipes.category", "pk": 2, "fields": {"name": "Dairy", "description": "Dairy and dairy alternatives are good sources of protein and vitamins. They also contain calcium, which helps keep our bones healthy and strong. Semi-skimmed, skimmed, and 1% fat milk all contain less fat than full-fat milk, but still give you protein, vitamins and calcium."}}, {"model": "recipes.category", "pk": 3, "fields": {"name": "Protein", "description": "Pulses are things like beans, peas and lentils. They’re a good source of fibre, vitamins and minerals and are naturally very low in fat. They count towards your five a day but only as one portion, no matter how much you eat.\r\n\r\nOther vegetable protein\r\nOther vegetable-based sources of protein include tofu, bean curd and mycoprotein and Quorn. They are full of protein, low in fat and can be used in place of meat in most recipes."}}, {"model": "recipes.recipe", "pk": 1, "fields": {"title": "Ultimate Chocolate Mousse", "description": "The very best semisweet dark chocolate you can find, we like Valrhona. The better the chocolate, the better the mousse. From age 1 to 100, all enjoy this.", "ingredients": "8 ounces semisweet dark chocolate, broken into 1/2-inch pieces\r\n\r\n6 large eggs, separated\r\n\r\n3 tablespoon water\r\n\r\n1/4 cup sweet liqueur (such as Chartreuse, amaretto, mandarin, or Grand Marnier)\r\n\r\n2 cups heavy cream\r\n\r\n6 tablespoons granulated sugar, divided\r\n\r\nWhipped cream and grated chocolate, for garnish", "instructions": "Place chocolate in top of a double boiler over simmering water, and cook over low, stirring occasionally, until chocolate is melted. Remove from heat, and set aside.\r\n\r\nPlace egg yolks and 3 tablespoons water in a heavy saucepan; cook over very low, whisking vigorously and constantly, until yolks begin to foam and thicken, about 6 minutes. Whisk in liqueur, and cook, whisking constantly, until sauce thickens enough to coat the back of a spoon, 6 to 8 minutes. (The sauce should achieve the consistency of a hollandaise or sabayon.) Remove from heat. Pour through a fine wire-mesh strainer into a bowl; discard solids.\r\n\r\nFold melted chocolate into sauce. Transfer chocolate mixture to a large bowl, and set aside.\r\n\r\nBeat cream with an electric mixer on high speed until stiff peaks form, 2 to 3 minutes, beating in 2 tablespoons sugar toward the end. Fold into chocolate mixture.\r\n\r\nUsing electric mixer fitted with the whisk attachment, beat egg whites on high speed until soft peaks start to form, about 1 minute. Beat in remaining 1/4 cup sugar and continue beating until stiff peaks form, 2 to 3 minutes. Fold into chocolate-cream mixture.\r\n\r\nSpoon mousse into a bowl, and chill until ready to serve, 4 hours or up to 24 hours. Garnish servings with whipped cream and grated chocolate.", "image": "recipes/Chocolate_mousse.webp", "created_by": 2, "chef": 1, "created_at": "2025-01-11T16:45:22.118Z", "categories": []}}, {"model": "recipes.recipe", "pk": 2, "fields": {"title": "Chicken Biryani", "description": "Biryani is known for its rich taste, the tenderness of the meat, and the aromatic rice, which often carries the essence of the spices used. It’s typically served with accompaniments like raita (yogurt-based side dish), salad, or a simple curry. Each region in India has its own unique style of preparing biryani, resulting in a variety of flavors and versions of this beloved dish. Here are the types of Biryani you can’t miss out on are as below:", "ingredients": "3 large red onions, sliced thin\r\n200ml peanut oil for frying\r\n1 kg chicken thighs, skin off\r\n4 tbsp yoghurt\r\n1 tsp chilli powder\r\n1/2 tsp ground turmeric\r\n1 tsp garam masala\r\n3 tsp ginger paste\r\n1 tsp garlic paste\r\nJuice of 1 lemon\r\n2 green chillies\r\n2 cinnamon sticks\r\n12 cardamom pod\r\n2 tsp cumin seeds\r\n6 cloves\r\nSalt to taste\r\n1 bunch mint\r\n1 bunch coriander\r\n1 kg aged basmati rice", "instructions": "Start by making the crispy onions by heating up the oil in a saucepan over a medium high heat and frying the sliced onions in batches until golden brown.\r\nNext, marinate your chicken by adding the chicken, 1/3 of the crispy onions, yoghurt, chilli powder, turmeric, garam masala, ginger, garlic, lemon juice, one cinnamon stick, 8 cardamom pods, 1 green chilli sliced thin, 1 tsp cumin seeds, 4 cloves, chopped mint and coriander and a tsp of salt in a large pot. Mix well and marinate for 4-24 hours.\r\nWith the rice, rinse it twice then soak it in water for 40 minutes\r\nIn a large pot, half filled with water, add 1 tbsp salt, 1 green chilli sliced lengthways in half, 6 green cardamom, 1 cinnamon stick, 2 cloves and 1 tsp cumin seeds and bring to a simmer.\r\nAdd the soaked rice to the simmering water, stir once and cook for 6-8 minutes or until its just cooked. You still want a bit of bite in the rice.\r\nRemove the rice from the water and set aside.\r\nPlace the marinated chicken onto a high heat and cook for 6-7 minutes, stirring every 1-2 minutes.\r\nRemove half of the chicken, then sprinkle half of the rice on the chicken in the pot.\r\nNext, add a layer of the crispy onions, some mint and coriander.\r\nPlace the rest of the chicken and repeat with the rice, crispy onions and herbs.\r\nPlace a clean tea towel over the lid of the pot and cover the biryani.\r\nTurn your element to medium high for 10 minutes, then turn it down to very low for 30 minutes. Take from the heat and let it rest for 20 minutes before taking the lid off and serving.\r\nEnjoy!", "image": "recipes/chicken-biryani.jpg", "created_by": 2, "chef": 1, "created_at": "2025-01-11T16:51:41.469Z", "categories": []}}, {"model": "recipes.recipe", "pk": 3, "fields": {"title": "Samosa", "description": "Flaky and crunchy fried Samosa are one of the most popular street food snack in North Indian cuisine. They feature a pastry-like crust but are filled with savory and spiced potato and green peas for a hearty, delicious snack. This step-by-step recipe guide will help you to make the flakiest, tastiest, absolutely best Punjabi Samosa or Aloo Samosa from scratch!", "ingredients": "1 kg potato\r\n250 gm peas\r\n½ inch cinnamon stick\r\n1 clove, optional\r\n1 green cardamom\r\n3 black peppercorns\r\n½ teaspoon cumin seeds\r\n½ teaspoon fennel seeds\r\n2 teaspoons coriander seeds", "instructions": "Cook Potato & Green Peas\r\n1. The first step is to cook the potatoes and peas for the savory and spiced filling.\r\n\r\nTo cook the potatoes and peas in a stovetop pressure cooker: Place 3 medium-sized whole potatoes (300 to 450 grams) and 2 to 2.5 cups water in a 3 or 4 litre pressure cooker. On top of the potatoes carefully set a small trivet and pressure cooker-safe bowl with ½ cup green peas. Pressure cook for 5 to 6 whistles or 7 to 8 minutes on medium to medium-high flame.\r\nIf using an Instant Pot: Place 3 medium-sized whole potatoes in the steel insert of a 6 quart IP. Add 2 cups water. Place a trivet on top of the potatoes, and on top of the trivet set a bowl with ½ cup of green peas. Pressure cook on high for 20 to 25 minutes.\r\npeas and potatoes in the Instant pot before being cooked\r\n2. For the stovetop pressure cooker, remove the lid after all the pressure falls in the cooker.\r\n\r\nFor the Instant Pot, do a quick pressure release after 5 to 7 minutes. Check with a knife or fork to see if the potatoes are cooked well.\r\n\r\nThe knife or fork should be able to slide through easily if the potatoes are cooked properly.\r\n\r\nIf the potatoes are undercooked, then cook them for a few more minutes using the pressure cook function. Once done, drain the potatoes and peas in a colander and set aside to cool.", "image": "recipes/Samosa-tall-FS.jpg", "created_by": 2, "chef": 3, "created_at": "2025-01-11T16:57:05.798Z", "categories": [2]}}, {"model": "recipes.recipe", "pk": 4, "fields": {"title": "Masala Dosa", "description": "Dosa is a thin savory crepe in South Indian cuisine that originated in South India but is now enjoyed throughout the country and beyond. It’s made from a fermented batter of rice and black gram (a type of lentil) ground together and left to ferment overnight, resulting in a slightly tangy flavours.", "ingredients": "3 cups uncooked white rice (such as jasmine or basmati)\r\n\r\n1 cup uncooked urad dal (split lentils) \r\n\r\n1 tablespoon fenugreek seeds\r\n\r\n3/4 to 1 cup water, plus cold water for rinsing and soaking\r\n\r\n1 tablespoon fine sea salt, divided\r\n\r\nMelted coconut oil or ghee\r\n\r\nAloo Masala (Potato Masala), for filling", "instructions": "Directions\r\nSoak the rice and lentils\r\nsoaking rice and lentils\r\nHeami Lee / Food Styling by Margaret Monroe Dickey / Prop Styling by Christine Keely\r\nCombine rice, urad dal, and fenugreek seeds in a large bowl. Add cold water to cover, and stir for 10 to 15 seconds; drain. Repeat rinsing process twice until water is mostly clear. Return rice mixture to bowl, and cover with about 4 inches of cold water. Set aside, uncovered, in a warm environment (75°F to 80°F) until rice and lentils double in size, 6 to 8 hours, stirring once after 1 hour.\r\n\r\nBlend the rice mixture\r\nrice mixture in blender\r\nHeami Lee / Food Styling by Margaret Monroe Dickey / Prop Styling by Christine Keely\r\nPour rice mixture through a fine wire-mesh strainer set over a large bowl; reserve soaking liquid. Working in 3 batches, transfer about one-third of rice mixture (about 2 1/2 cups) to a high-speed blender; add 1 teaspoon salt and 1/2 cup reserved soaking liquid. Blend on low speed, gradually increasing speed to high, until a smooth, thick batter forms, 1 to 2 minutes, adding 1 to 2 tablespoons additional soaking liquid if needed. (Batter will feel slightly gritty to the touch.) Pour batter into a large (3- to 4-quart) container. Repeat process 2 times using remaining rice mixture, remaining salt, and 1 cup reserved soaking liquid, plus more as needed. (If using a blender that is not high-speed, work in 6 batches, using 1 1/4 cups rice mixture, 1/2 teaspoon salt, and 1/4 cup reserved soaking liquid for each batch.)\r\n\r\nFerment the batter\r\nferment the dosa batter\r\nHeami Lee / Food Styling by Margaret Monroe Dickey / Prop Styling by Christine Keely\r\nWhisk 1/4 cup reserved soaking liquid into batter; discard remaining soaking liquid. (Batter should resemble thick pancake batter and should fall off whisk in a thick ribbon, leaving a trail on top of batter for about 10 seconds before sinking back into batter.) Cover container; let stand in a warm environment (75°F to 80°F) until slightly puffed, bubbles have formed all over, and batter has a sour smell, about 12 hours.\r\n\r\nThin the batter\r\nthin the dosa batter\r\nHeami Lee / Food Styling by Margaret Monroe Dickey / Prop Styling by Christine Keely\r\nThin batter with 3/4 to 1 cup water, 1/4 cup at a time, until consistency resembles a slightly thickened crêpe batter and batter falls off ladle in a thick ribbon, leaving a 1-second trail on batter surface.\r\n\r\nSpread the batter in the skillet\r\nspread dosa batter in skillet\r\nHeami Lee / Food Styling by Margaret Monroe Dickey / Prop Styling by Christine Keely\r\nHeat a 10-inch cast-iron skillet over medium-high. Brush hot skillet lightly with melted coconut oil, wiping with a paper towel to remove excess oil. Ladle 1/4 cup batter in center of skillet. Using bottom of ladle, quickly spread batter outward in a spiral motion, applying even, constant pressure to form a thin 6- to 8-inch round. (Stop spreading once ladle begins to stick to pan.)\r\n\r\nCook the dosa\r\nDosa cooking in skillet\r\nHeami Lee / Food Styling by Margaret Monroe Dickey / Prop Styling by Christine Keely\r\nDrizzle about 1/2 teaspoon oil around edge and on top of dosa; cook until bottom browns, edge crisps, and top is set, about 2 minutes. If desired, flip dosa, and cook until second side is very lightly browned, 10 to 15 seconds. Loosen dosa edge using a thin spatula. Add about 3 tablespoons Aloo Masala to half of dosa; fold dosa over filling, and serve immediately. Repeat as desired to make more dosas. Leftover batter can be refrigerated, covered, up to 2 weeks.", "image": "recipes/masala_dosa.jpg", "created_by": 2, "chef": 1, "created_at": "2025-01-11T18:14:55.922Z", "categories": []}}, {"model": "recipes.recipe", "pk": 5, "fields": {"title": "Butter Chicken", "description": "Butter Chicken, also known as “Murgh Makhani,” is a popular Indian dish that originated in Delhi and has gained immense popularity worldwide. It’s a rich and creamy dish made with tender pieces of chicken marinated in a mixture of yogurt and spices, traditionally cooked in a tandoor (clay oven) to impart a smoky flavour.", "ingredients": "1 cup butter, divided\r\n\r\n1 onion, minced\r\n\r\n1 tablespoon minced garlic\r\n\r\n1 (15 ounce) can tomato sauce\r\n\r\n3 cups heavy cream\r\n\r\n2 teaspoons salt\r\n\r\n1 teaspoon cayenne pepper\r\n\r\n1 teaspoon garam masala\r\n\r\n1 ½ pounds skinless, boneless chicken breast, cut into bite-sized chunks\r\n\r\n2 tablespoons vegetable oil\r\n\r\n2 tablespoons tandoori masala", "instructions": "Gather all ingredients. Preheat the oven to 375 degrees F (190 degrees C).\r\n\r\nIngredients to make easy Indian butter chicken\r\nMelt 2 tablespoons butter in a skillet over medium heat. Stir in onion and garlic, and cook slowly until the onion caramelizes to a dark brown, about 15 minutes.\r\n\r\nA pan with dark, caramelized chopped onion\r\nMeanwhile, combine cream, tomato sauce, remaining butter, salt, cayenne pepper, and garam masala in a saucepan over medium-high heat; bring to a simmer.\r\n\r\nA small pot of seasoned creamy tomato sauce\r\nReduce heat to medium-low, cover, and simmer, stirring occasionally, for 30 minutes. Stir in caramelized onions.\r\n\r\nCaramelized onions in a large pan being poured into a pot of creamy tomato sauce\r\nWhile the sauce is simmering, toss chicken with vegetable oil until coated. Season with tandoori masala and spread out onto a baking sheet.\r\n\r\nA baking sheet with pieces of chicken breast coated in oil and tandoori masala\r\nBake chicken in the preheated oven until no longer pink in the center, about 12 minutes.\r\n\r\nA baking sheet with baked pieces of seasoned chicken\r\nAdd cooked chicken to the sauce and simmer for 5 minutes before serving.", "image": "recipes/Butter-Chicken.jpg", "created_by": 2, "chef": 1, "created_at": "2025-01-11T18:18:13.734Z", "categories": []}}, {"model": "recipes.recipe", "pk": 6, "fields": {"title": "Gulab-jamun", "description": "Gulab Jamun is India’s most famous and favorite dessert It consists of deep-fried dough balls, which are then soaked in a sugary syrup flavored with rose water, saffron, cardamom, and sometimes with a touch of lemon juice or rose petals.\r\n\r\nThese dough balls are made from a mixture of milk solids (khoya), flour, and a leavening agent like baking soda. Once shaped into small balls, they are fried until they become golden brown, creating a crispy exterior while maintaining a soft, spongy texture inside.", "ingredients": "4 green cardamom pods\r\nlightly squashed with the side of a knife\r\n600g caster sugar\r\nfew drops rosewater\r\n¼ tsp saffron strands\r\nsoaked in 2 tbsp warm water for 1 hr\r\n2 tsp chopped pistachios\r\nFor the gulab jamun\r\n6 green cardamom pods\r\nseeds removed\r\n1 tsp caster sugar\r\n100g full-cream milk powder\r\n40g plain flour\r\n½ tsp baking powder\r\n50g ghee\r\nor softened unsalted butter plus 1kg ghee, for frying\r\n1 tbsp natural yogurt\r\nsqueeze of lemon juice\r\n4-5 tbsp whole milk\r\nsunflower oil", "instructions": "step 1\r\nTo make the syrup, gently heat the cardamom, sugar and 500ml water in a saucepan. Don't let the water boil before the sugar has dissolved. Simmer for 10 mins, then cool.\r\n\r\nstep 2\r\nGradually add the rosewater, saffron and a little of its soaking liquid until you have a subtly flavoured syrup. Set aside.\r\n\r\nstep 3\r\nTo make the gulab jamun, use a pestle and mortar to grind together the cardamom and sugar until fine.\r\n\r\nstep 4\r\nSieve the milk powder, flour and baking powder into a mixing bowl and stir in the cardamom and sugar mixture. Rub in the 50g ghee or butter using your fingertips until the mixture resembles coarse crumbs.\r\n\r\nstep 5\r\nAdd the yogurt, lemon juice and enough milk to form a soft dough, taking care not to overwork the mixture.\r\n\r\nstep 6\r\nOil your hands with a little sunflower oil and shape small portions of the dough into walnut-sized balls, about 3cm in diameter and 20g each. Make sure the dumplings are smooth and have no cracks or folds.\r\n\r\nstep 7\r\nReheat the syrup until it comes to the boil, then turn off the heat and cover with a lid.\r\n\r\nstep 8\r\nHeat the 1kg ghee in a wok or karahi to 130C or until a small piece of dough dropped in turns golden in 40 seconds. Fry the balls, in batches, over a medium heat for 5-7 mins, moving them around until they are an even, deep brown. Remove from the saucepan using a slotted spoon, then drain on kitchen paper. Add to the warm syrup, leaving them to soak for 2-3 hrs or preferably overnight.\r\n\r\nstep 9\r\nWhen ready to eat, warm the gulab jamun through in a wide saucepan, spooning over the syrup. Serve piping hot with the pistachios scattered over.", "image": "recipes/GulabJamun.jpg", "created_by": 2, "chef": 1, "created_at": "2025-01-11T18:20:58.774Z", "categories": []}}, {"model": "recipes.userprofile", "pk": 1, "fields": {"user": 2, "first_name": "Aman", "last_name": "Dubey", "profile_picture": "profile_pictures/Aman_Dubey-DP_p9ulWY7.png", "phone": "09039163669", "address": "New Delhi, India"}}, {"model": "recipes.userprofile", "pk": 2, "fields": {"user": 3, "first_name": "Gordon", "last_name": "Ramsay", "profile_picture": "profile_pictures/gordan_ramsay.jpeg", "phone": "8930790372", "address": "Manhattan, New York City"}}, {"model": "recipes.userprofile", "pk": 3, "fields": {"user": 4, "first_name": "Vikas", "last_name": "Khanna", "profile_picture": "profile_pictures/459057842_1888557258287325_8465760702994459967_n.jpg", "phone": "9039163669", "address": "Times Square, NYC"}}, {"model": "recipes.review", "pk": 1, "fields": {"recipe": 1, "user": 2, "rating": 4, "comment": "Very good recipe", "created_at": "2025-01-12T18:39:57.228Z"}}, {"model": "recipes.review", "pk": 2, "fields": {"recipe": 1, "user": 2, "rating": 4, "comment": "Very good recipe", "created_at": "2025-01-12T18:40:45.263Z"}}, {"model": "recipes.review", "pk": 3, "fields": {"recipe": 2, "user": 4, "rating": 5, "comment": "Amazing", "created_at": "2025-01-12T19:23:50.750Z"}}]